; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-98)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 - object)
 (:init 
    (arm-empty)
    (clear b15)
    (on b15 b17)
    (on b17 b18)
    (on b18 b22)
    (on b22 b21)
    (on-table b21)
    (clear b4)
    (on b4 b23)
    (on b23 b14)
    (on b14 b16)
    (on b16 b2)
    (on-table b2)
    (clear b13)
    (on b13 b7)
    (on b7 b11)
    (on b11 b9)
    (on b9 b27)
    (on b27 b25)
    (on b25 b3)
    (on-table b3)
    (clear b1)
    (on b1 b24)
    (on b24 b5)
    (on b5 b12)
    (on b12 b6)
    (on b6 b19)
    (on b19 b10)
    (on b10 b20)
    (on b20 b26)
    (on-table b26)
    (clear b28)
    (on b28 b8)
    (on b8 b29)
    (on-table b29))
 (:goal (and 
(on b16 b21)
))
)

; plan
1. (unstack b4 b23)
   deleted: (on b4 b23) (clear b4) (arm-empty)
   added: (holding b4) (clear b23)
   goals met: 0 of 1
2. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 1
3. (unstack b23 b14)
   deleted: (on b23 b14) (clear b23) (arm-empty)
   added: (holding b23) (clear b14)
   goals met: 0 of 1
4. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 1
5. (unstack b15 b17)
   deleted: (on b15 b17) (clear b15) (arm-empty)
   added: (holding b15) (clear b17)
   goals met: 0 of 1
6. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 1
7. (unstack b17 b18)
   deleted: (on b17 b18) (clear b17) (arm-empty)
   added: (holding b17) (clear b18)
   goals met: 0 of 1
8. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 1
9. (unstack b18 b22)
   deleted: (on b18 b22) (clear b18) (arm-empty)
   added: (holding b18) (clear b22)
   goals met: 0 of 1
10. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 1
11. (unstack b14 b16)
   deleted: (on b14 b16) (clear b14) (arm-empty)
   added: (holding b14) (clear b16)
   goals met: 0 of 1
12. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 1
13. (unstack b22 b21)
   deleted: (on b22 b21) (clear b22) (arm-empty)
   added: (holding b22) (clear b21)
   goals met: 0 of 1
14. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 1
15. (unstack b16 b2)
   deleted: (on b16 b2) (clear b16) (arm-empty)
   added: (holding b16) (clear b2)
   goals met: 0 of 1
16. (stack b16 b21)
   deleted: (clear b21) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b21)
   goals met: 1 of 1
